cf/AccumulationRegisters/IncomeAndExpensesUndistributed.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>IncomeAndExpensesUndistributed</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountIncome</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountExpense</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
						<v8:Type>cfg:DocumentRef.Netting</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Item</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/IncomeAndExpensesUndistributed/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	IncomeAndExpensesUndistributed.LineNumber AS LineNumber,
	|	IncomeAndExpensesUndistributed.Company AS Company,
	|	IncomeAndExpensesUndistributed.Document AS Document,
	|	IncomeAndExpensesUndistributed.Item AS Item,
	|	IncomeAndExpensesUndistributed.AmountIncome AS AmountIncomeBeforeWrite,
	|	IncomeAndExpensesUndistributed.AmountIncome AS AmountIncomeUpdate,
	|	IncomeAndExpensesUndistributed.AmountIncome AS AmountIncomeOnWrite,
	|	IncomeAndExpensesUndistributed.AmountExpense AS AmountExpensesBeforeWrite,
	|	IncomeAndExpensesUndistributed.AmountExpense AS AmountExpensesUpdate,
	|	IncomeAndExpensesUndistributed.AmountExpense AS AmountExpensesOnWrite
	|INTO RegisterRecordsIncomeAndExpensesUndistributedChange
	|FROM
	|	AccumulationRegister.IncomeAndExpensesUndistributed AS IncomeAndExpensesUndistributed");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsIncomeAndExpensesUndistributedChange", False);
	
EndProcedure // CreateEmptyTemporaryTableChange()

#EndRegion

#EndIf
